Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.0.31/edc/ATSAML10D16A.PIC
      <edc:AdjustPoint edc:_addr="0x42002C10" edc:offset="0x3F0"/>
      <edc:SFRDef edc:_addr="0x42003000" edc:access="n-----nn" edc:cname="CTRLA" edc:impl="0x83" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPMUX" edc:desc="Low-Power Mux" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003001" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42003002" edc:access="-----rrr" edc:cname="STATUS" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="READY0" edc:desc="OPAMP 0 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:desc="OPAMP 1 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY2" edc:desc="OPAMP 2 Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42003004" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="OPAMPCTRL0" edc:impl="0xFFFFFE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Operational Amplifier Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:desc="Analog Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:desc="Bias Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:desc="Resistor ladder To VCC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:desc="Resistor ladder To Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:desc="Resistor 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:desc="Resistor 1 Mux" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OAxPOS" edc:desc="Positive inout of OPAMPx" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OAxNEG" edc:desc="Negative input of OPAMPx" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RG_CONN" edc:desc="RG_CONN" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:desc="Potentiometer Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="Gain = 0.14" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="Gain = 0.33" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="Gain = 1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="Gain = 1.67" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="Gain = 3" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="Gain = 4.33" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="Gain = 7" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="Gain = 15" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA0POS" edc:desc="Positive I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="Resistor ladder 0 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0xF) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="Negative I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="Resistor ladder 0 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0xF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003008" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="OPAMPCTRL1" edc:impl="0xFFFFFE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Operational Amplifier Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:desc="Analog Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:desc="Bias Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:desc="Resistor ladder To VCC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:desc="Resistor ladder To Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:desc="Resistor 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:desc="Resistor 1 Mux" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OAxPOS" edc:desc="Positive inout of OPAMPx" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OAxNEG" edc:desc="Negative input of OPAMPx" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RG_CONN" edc:desc="RG_CONN" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:desc="Potentiometer Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="Gain = 0.14" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="Gain = 0.33" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="Gain = 1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="Gain = 1.67" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="Gain = 3" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="Gain = 4.33" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="Gain = 7" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="Gain = 15" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA1POS" edc:desc="Positive I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA1TAP" edc:desc="Resistor ladder 1 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0xF) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="Negative I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="Resistor ladder 0 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0xF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200300C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="OPAMPCTRL2" edc:impl="0xFFFFFE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Operational Amplifier Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:desc="Analog Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:desc="Bias Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:desc="Resistor ladder To VCC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:desc="Resistor ladder To Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:desc="Resistor 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:desc="Resistor 1 Mux" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OAxPOS" edc:desc="Positive inout of OPAMPx" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OAxNEG" edc:desc="Negative input of OPAMPx" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="OA1OUT" edc:desc="OPAMP1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:desc="Potentiometer Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="Gain = 0.14" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="Gain = 0.33" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="Gain = 1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="Gain = 1.67" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="Gain = 3" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="Gain = 4.33" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="Gain = 7" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="Gain = 15" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA2POS" edc:desc="Positive I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA2TAP" edc:desc="Resistor ladder 2 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OA1OUT" edc:desc="OPAMP1 output" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OA0POS" edc:desc="Positive I/O pin OPA0" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OA1POS" edc:desc="Positive I/O pin OPA1" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor Ladder Taps" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="RES3TAP" edc:desc="Resistor ladder 3 taps" edc:when="(field &amp; 0xF) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input Mux Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="Negative I/O pin" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="Resistor ladder 0 taps" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFERENCE_DAC" edc:desc="REFERENCE or DAC output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0xF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003010" edc:access="nnnnnnnn" edc:cname="RESCTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OPAMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:desc="Resistor ladder To Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:desc="Resistor 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:desc="Resistor 1 Mux" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFBUF" edc:desc="REFERENCE output" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:desc="Potentiometer Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="Gain = 0.14" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="Gain = 0.33" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="Gain = 1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="Gain = 1.67" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="Gain = 3" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="Gain = 4.33" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="Gain = 7" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="Gain = 15" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFBUFLEVEL" edc:desc="Reference output voltage level select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="1_1v" edc:desc="1.1v" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1_25v" edc:desc="1.25v" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="1_6v" edc:desc="1.6v" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003011" edc:offset="0x3EF"/>
      <edc:SFRDef edc:_addr="0x42003400" edc:access="nn-n--nn" edc:cname="CTRLA" edc:impl="0xD3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRAM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TAMPERS" edc:desc="Tamper Erase" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:desc="Data Remanence Prevention" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SILACC" edc:desc="Silent Access" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003401" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003404" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRAM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="TrustRAM Readout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:desc="Data Remanence Prevention Ended Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003405" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRAM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="TrustRAM Readout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:desc="Data Remanence Prevention Ended Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003406" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRAM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="TrustRAM Readout Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:desc="Data Remanence Prevention Ended" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
